redditonrails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Cat Food"], ["url", "meowbites.com"], ["content", "kitten whiskers"], ["author_id", 5], ["created_at", "2018-11-21 00:51:49.772018"], ["updated_at", "2018-11-21 00:51:49.772018"]]