redditonrails/app/controllers/subs_controller.rb

  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update(sub_params)
---
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Dog lovers unite! Woof Woof"], ["updated_at", "2018-11-20 22:06:55.027594"], ["id", 1]]